Autodesk.Revit.DB.Transform.AlmostEqual(Autodesk.Revit.DB.Transform)
Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
right: The transformation to compare with this transformation.
Returns: True if the two transformations are equal; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified transformation is null.
Remarks:
The tolerance is applied memberwise for comparison.

Autodesk.Revit.DB.Transform.ScaleBasisAndOrigin(System.Double)
Scales the basis vectors and the origin of this transformation and returns the result.
scale: The scale value.
Returns: The transformation equal to the composition of the two transformations.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Remarks:
The resulting transformation is equivalent to the application of this transformation
and then the uniform scale, in this order.

Autodesk.Revit.DB.Transform.ScaleBasis(System.Double)
Scales the basis vectors of this transformation and returns the result.
scale: The scale value.
Returns: The transformation equal to the composition of the two transformations.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Remarks:
The resulting transformation is equivalent to the application of the uniform scale
and then this transformation, in this order.

Autodesk.Revit.DB.Transform.Multiply(Autodesk.Revit.DB.Transform)
Multiplies this transformation by the specified transformation and returns the result.
right: The specified transformation.
Returns: The transformation equal to the composition of the two transformations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the handle of the specified transformation is null.
Remarks:
The combined transformation has the same effect as applying the right transformation first,
and the left transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).

Autodesk.Revit.DB.Transform.op_Multiply(Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.Transform)
Multiplies the two specified transforms.
left: The first transformation.
right: The second transformation.
Returns: The transformation equal to the composition of the two transformations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the handle of the first or second transformation is null.
Remarks:
The combined transformation has the same effect as applying the right transformation first,
and the left transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).

Autodesk.Revit.DB.Transform.Inverse
The inverse transformation of this transformation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this transformation is not conformal or invertible.
Remarks:
The transformation matrix A is invertible if there exists a transformation matrix B
such that A*B = B*A = I (identity).

Autodesk.Revit.DB.Transform.Determinant
The determinant of this transformation.
Remarks:
The geometric meaning of a determinant is as the scale factor for volume
when applied as linear transformation.

Autodesk.Revit.DB.Transform.IsConformal
The boolean value that indicates whether this transformation is conformal.
Remarks:
This property is true if this transformation can be decomposed as the product of
a rigid-body motion, uniform scale and reflection.  Such transformation preserves
angles between vectors.

Autodesk.Revit.DB.Transform.HasReflection
The boolean value that indicates whether this transformation produces reflection.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this transformation is not conformal and the reflection is undefined.
Remarks:
Reflection transformation changes the handedness of a coordinate system.

Autodesk.Revit.DB.Transform.Scale
The real number that represents the scale of the transformation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this transformation is not conformal and the scale is undefined.
Remarks:
When the transformation is conformal and can be decomposed as the product of
a rigid-body motion, uniform scale and reflection, this property returns the scale
value of the uniform scale transformation.

Autodesk.Revit.DB.Transform.IsTranslation
The boolean value that indicates whether this transformation is a translation.
Remarks:
This property is true if the only effect of transformation is translation. It checks that the
basis of the transform is identity. The translation vector may be zero (which would make this
an identity transformation) or nonzero (which would make this a non-trivial translation).

Autodesk.Revit.DB.Transform.IsIdentity
The boolean value that indicates whether this transformation is an identity.
Remarks:
The identity transformation does not change a point or a vector that it is applied to.

Autodesk.Revit.DB.Transform.OfVector(Autodesk.Revit.DB.XYZ)
Applies the transform to the vector
vec: The vector to be transformed
Returns: The new vector after transform
Remarks:
Transformation of a vector is not affected by the translational part of the transformation.

Autodesk.Revit.DB.Transform.OfPoint(Autodesk.Revit.DB.XYZ)
Applies the transformation to the point and returns the result.
point: The point to transform.
Returns: The transformed point.
Remarks:
Transformation of a point is affected by the translational part of the transformation.

Autodesk.Revit.DB.Transform.CreateReflection(Autodesk.Revit.DB.Plane)
Creates a transform that represents a reflection across the given plane.
plane:
The plane.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Transform.CreateRotationAtPoint(Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.XYZ)
Creates a transform that represents a rotation about the given axis at the specified point.
axis:
The rotation axis.
angle:
The angle.
origin:
The origin point.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
axis has zero length.
Since:
2014

Autodesk.Revit.DB.Transform.CreateRotation(Autodesk.Revit.DB.XYZ,System.Double)
Creates a transform that represents a rotation about the given axis at (0, 0, 0).
axis:
The rotation axis.
angle:
The angle.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
axis has zero length.
Since:
2014

Autodesk.Revit.DB.Transform.CreateTranslation(Autodesk.Revit.DB.XYZ)
Creates a transform that represents a translation via the specified vector.
vector:
The translation vector.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Transform.Identity
The identity transformation.
Remarks:
The identity transformation does not change a point or a vector that it is applied to.

Autodesk.Revit.DB.Transform.Origin
Defines the origin of the old coordinate system in the new coordinate system.
Remarks: This corresponds to the fourth column vector of the conventional 3x4 matrix
representation. Also, this is the translation component of the transformation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the transform is internally marked as read-only.

Autodesk.Revit.DB.Transform.Basis(System.Int32)
Defines the basis of the old coordinate system in the new coordinate system.
idx: The index of the basis vector: 0, 1 or 2.
Remarks: This corresponds to the first three column vectors of the conventional 3x4 matrix
representation.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the given index is larger than 2 in the getter and setter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the transform is internally marked as read-only.

Autodesk.Revit.DB.Transform.BasisZ
The basis of the Z axis of this transformation.
Remarks:
The Z axis of the old coordinate system in the new coordinate system,
or the 3rd column of the conventional 3x4 matrix representation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the transform is internally marked as read-only.

Autodesk.Revit.DB.Transform.BasisY
The basis of the Y axis of this transformation.
Remarks:
The Y axis of the old coordinate system in the new coordinate system,
or the 2nd column of the conventional 3x4 matrix representation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the transform is internally marked as read-only.

Autodesk.Revit.DB.Transform.BasisX
The basis of the X axis of this transformation.
Remarks:
The X axis of the old coordinate system in the new coordinate system,
or the 1st column of the conventional 3x4 matrix representation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the transform is internally marked as read-only.

Autodesk.Revit.DB.Transform.#ctor(Autodesk.Revit.DB.Transform)
The copy constructor.

Autodesk.Revit.DB.Transform
A transformation of the affine 3-space.